InformationRegisters/ЛБ_НастройкаВыводаРазмеровДрагоценныхКамней.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_НастройкаВыводаРазмеровДрагоценныхКамней</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ВидКамня</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ДрагоценныеКамни</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФормаОгранки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ФормыОгранки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОгранки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ВидыОгранки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Размер</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_РазмерыДрагоценныхКамней</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЛБ_НастройкаДопустимыхВидовОгранки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_НастройкаДопустимыхВидовОгранки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Формула</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособРасчетаВеса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_СпособыРасчетаВесаДрагоценныхКамней</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ОграниченныйСписокВидовОгранки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ВидКамня</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ДрагоценныеКамни</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФормаОгранки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ФормыОгранки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОгранки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ВидыОгранки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЛБ_НастройкаДопустимыхФормОгранки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_НастройкаДопустимыхФормОгранки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОграниченныйСписокВидовОгранки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ВидКамня</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ДрагоценныеКамни</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КатегорияОбъектаЗалога</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_КатегорииОбъектовЗалога</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФормаОгранки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ФормыОгранки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЛБ_НастройкаДопустимыхКачествОгранки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_НастройкаДопустимыхКачествОгранки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ВидКамня</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ДрагоценныеКамни</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КатегорияОбъектаЗалога</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_КатегорииОбъектовЗалога</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Именник</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_Именник</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФормаОгранки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ФормыОгранки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОгранки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ВидыОгранки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КачествоОгранки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_КачествоОгранки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ЛБ_СпособыРасчетаВесаДрагоценныхКамней.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_СпособыРасчетаВесаДрагоценныхКамней</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоТаблице</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоФормуле</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Вручную</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ЛБ_РазмерыДрагоценныхКамней.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_РазмерыДрагоценныхКамней</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Диаметр</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Длина</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ширина</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Высота</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Диаметр1</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Диаметр2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сторона</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ЛБ_ДрагоценныеКамни.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ЛБ_ДрагоценныеКамни</Name>
			<Comment>Виды драгоценных камней</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидКамня</Name>
					<Comment>Вид камня</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыКамней</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткоеНаименование</Name>
					<Comment>Краткое наименование</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеКлассификатораГИИСДМДК</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаКодированияГИИСДМДК</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеОценивается</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonForms/ЛБ_КорректировкаВставки/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.ТолькоПросмотр = Истина Тогда
		Элементы.СохранитьИЗакрыть.Доступность = ложь;
	КонецЕсли;	
	Если Параметры.Свойство("ВидВставки") Тогда 
		ВидВставки = Параметры.ВидВставки;
	КонецЕсли;
	Если Параметры.Свойство("ФормаОгранки") Тогда 
		ФормаОгранки = Параметры.ФормаОгранки;
	КонецЕсли;
	Если Параметры.Свойство("ВидОгранки") Тогда 
		ВидОгранки = Параметры.ВидОгранки;
	КонецЕсли;
	Если Параметры.Свойство("КачествоОгранки") Тогда 
		КачествоОгранки = Параметры.КачествоОгранки;
	КонецЕсли;
	Если Параметры.Свойство("Диаметр") Тогда 
		Диаметр = Параметры.Диаметр;
	КонецЕсли; 
	Если Параметры.Свойство("Диаметр1") Тогда 
		Диаметр1 = Параметры.Диаметр1;
	КонецЕсли;
    Если Параметры.Свойство("Диаметр2") Тогда 
		Диаметр2 = Параметры.Диаметр2;
	КонецЕсли;
	Если Параметры.Свойство("Длина") Тогда 
		Длина = Параметры.Длина;
	КонецЕсли;
    Если Параметры.Свойство("Ширина") Тогда 
		Ширина1 = Параметры.Ширина;
	КонецЕсли;
    Если Параметры.Свойство("Высота") Тогда 
		Высота1 = Параметры.Высота;
	КонецЕсли;    
	Если Параметры.Свойство("Сторона") Тогда 
		Сторона = Параметры.Сторона;
	КонецЕсли;
    Если Параметры.Свойство("Количество") Тогда 
		Количество = Параметры.Количество;
	КонецЕсли; 
	Если Параметры.Свойство("ВесКар") Тогда 
		Вес = Параметры.ВесКар;
		ВесШт = ?(Количество = 0, 0, Вес/Количество);
	КонецЕсли; 
	Если Параметры.Свойство("ВесГраммы") Тогда 
		ВесГраммы = Параметры.ВесГраммы; 
		ВесГраммыШт = ?(Количество = 0, 0, ВесГраммы/Количество);
	КонецЕсли; 
	Если Параметры.Свойство("Именник") Тогда 
		Именник = Параметры.Именник;
	КонецЕсли;  
    Если Параметры.Свойство("КатегорияОбъектаЗалога") Тогда 
		КатегорияОбъектаЗалога = Параметры.КатегорияОбъектаЗалога;
	КонецЕсли;   
	Если Параметры.Свойство("ВесВручную") Тогда 
		ВесВручную = Параметры.ВесВручную;
	КонецЕсли;
	Если Параметры.Свойство("НоваяСтрока") Тогда 
		НоваяСтрока = Параметры.НоваяСтрока;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ВидВставки) Тогда  
		ЕдиницаИзмерения = ПолучитьЕдиницуРасчета();
		ЗаполнитьСписокВыбораКачестваОгранки();
		ПроверитьФормуОгранки(); 	
		ЗаполнитьСписокВыбораВидовОгранки();
    КонецЕсли;
    УстановитьВидимость(); 
	ПолучитьСпособРасчетаВеса();
	УстановитьДоступность();   
	Если СпособРасчетаВеса = Перечисления.ЛБ_СпособыРасчетаВесаДрагоценныхКамней.ПоТаблице Тогда
		РассчитатьВесКамняПоТаблице();  
	ИначеЕсли СпособРасчетаВеса = Перечисления.ЛБ_СпособыРасчетаВесаДрагоценныхКамней.ПоФормуле Тогда
		РассчитатьВесКамняПоФормуле();  	
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимость()
	Элементы.ГруппаД0.Видимость = Ложь; 
	Элементы.ГруппаД1.Видимость = Ложь;
	Элементы.ГруппаД2.Видимость = Ложь;
	Элементы.ГруппаД.Видимость = Ложь;
	Элементы.ГруппаШ.Видимость = Ложь;
	Элементы.ГруппаВ.Видимость = Ложь; 
	Элементы.ГруппаС.Видимость = Ложь;
	
	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("ВидКамня", ВидВставки); 
	СписокФО = Новый СписокЗначений;
	СписокФО.Добавить(Справочники.ЛБ_ФормыОгранки.ПустаяСсылка());
	Если ЗначениеЗаполнено(ФормаОгранки) Тогда     
		СписокФО.Добавить(ФормаОгранки);
	КонецЕсли;	
	Запрос.УстановитьПараметр("ФормаОгранки", СписокФО);
	Запрос.УстановитьПараметр("ВидОгранки", ВидОгранки);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_НастройкаВыводаРазмеровДрагоценныхКамней.Размер КАК Размер
	               |ИЗ
	               |	РегистрСведений.ЛБ_НастройкаВыводаРазмеровДрагоценныхКамней КАК ЛБ_НастройкаВыводаРазмеровДрагоценныхКамней
	               |ГДЕ
	               |	ЛБ_НастройкаВыводаРазмеровДрагоценныхКамней.ВидКамня = &ВидКамня
	               |	И ЛБ_НастройкаВыводаРазмеровДрагоценныхКамней.ФормаОгранки В(&ФормаОгранки)
	               |	И ЛБ_НастройкаВыводаРазмеровДрагоценныхКамней.ВидОгранки = &ВидОгранки";
	ТаблицаРазмеров = Запрос.Выполнить().Выгрузить();
	Для каждого стр из ТаблицаРазмеров Цикл 
		Если стр.Размер = Перечисления.ЛБ_РазмерыДрагоценныхКамней.Диаметр Тогда
			Элементы.ГруппаД0.Видимость = Истина;  
		КонецЕсли;
		Если стр.Размер = Перечисления.ЛБ_РазмерыДрагоценныхКамней.Диаметр1 Тогда
			Элементы.ГруппаД1.Видимость = Истина;
		КонецЕсли;	
		Если стр.Размер = Перечисления.ЛБ_РазмерыДрагоценныхКамней.Диаметр2 Тогда
			Элементы.ГруппаД2.Видимость = Истина;
		КонецЕсли;	
		Если стр.Размер = Перечисления.ЛБ_РазмерыДрагоценныхКамней.Длина Тогда
			Элементы.ГруппаД.Видимость = Истина;
		КонецЕсли;	
		Если стр.Размер = Перечисления.ЛБ_РазмерыДрагоценныхКамней.Ширина Тогда
			Элементы.ГруппаШ.Видимость = Истина;
		КонецЕсли;	
		Если стр.Размер = Перечисления.ЛБ_РазмерыДрагоценныхКамней.Высота Тогда
			Элементы.ГруппаВ.Видимость = Истина;
		КонецЕсли;
		Если стр.Размер = Перечисления.ЛБ_РазмерыДрагоценныхКамней.Сторона Тогда
			Элементы.ГруппаС.Видимость = Истина;
		КонецЕсли;	
	Конеццикла;	 
	
	Если НЕ Элементы.ГруппаД0.Видимость И НЕ (Диаметр = 0) Тогда 
		Диаметр = 0;
	КонецЕсли;	
	Если НЕ Элементы.ГруппаД1.Видимость И НЕ (Диаметр1 = 0) Тогда
		Диаметр1 = 0;
	КонецЕсли;	
	Если НЕ Элементы.ГруппаД2.Видимость И НЕ (Диаметр2 = 0) Тогда
		Диаметр2 = 0;
	КонецЕсли;	
	Если НЕ Элементы.ГруппаД.Видимость И НЕ (Длина = 0) Тогда 
		Длина = 0;
	КонецЕсли;	
	Если НЕ Элементы.ГруппаШ.Видимость И НЕ (Ширина1 = 0) Тогда 
		Ширина1 = 0;
	КонецЕсли;	
	Если НЕ Элементы.ГруппаВ.Видимость И НЕ (Высота1 = 0) Тогда 
		Высота1 = 0;
	КонецЕсли;	
    Если НЕ Элементы.ГруппаС.Видимость И НЕ (Сторона = 0) Тогда 
		Сторона = 0;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УстановитьДоступность() 
	Если СпособРасчетаВеса = Перечисления.ЛБ_СпособыРасчетаВесаДрагоценныхКамней.Вручную Тогда
		Элементы.ВесШт.Доступность = Истина; 
		Элементы.ВесГраммыШт.Доступность = Истина;
	Иначе
		Элементы.ВесШт.Доступность = ложь; 
		Элементы.ВесГраммыШт.Доступность = ложь;
	КонецЕсли;
	Если СпособРасчетаВеса = Перечисления.ЛБ_СпособыРасчетаВесаДрагоценныхКамней.ПоФормуле Тогда 
		Элементы.ГруппаФормула.Видимость = Истина;
	Иначе
		Элементы.ГруппаФормула.Видимость = ложь;
    КонецЕсли;

 	//+Мельников 25.07.24 Если вес вручную то размеры не видно. Заявка 2737
	Если ВесВручную Тогда
		Элементы.ГруппаРазмеры.Доступность = Ложь;
	Иначе
		Элементы.ГруппаРазмеры.Доступность = Истина;
	КонецЕсли;
	
	//+Мельников 25.07.24 Если вес вручную и категория 3 или 4 то доступен ввод общего веса в каратах. Заявка 2737
	Если ВесВручную И КатегорияОбъектаЗалога.ПониженноеКачество Тогда
		Элементы.Вес.ТолькоПросмотр = Ложь;
	Иначе
		Элементы.Вес.ТолькоПросмотр = Истина;
	КонецЕсли;

	//+Мельников 29.07.24 Доступность "Качество огранки" и других параметров. Заявка 2736
	Если ЗначениеЗаполнено(ВидВставки) И ВидВставки = Справочники.ЛБ_ДрагоценныеКамни.Бриллиант Тогда
		Если Элементы.КачествоОгранки.СписокВыбора.Количество() > 0 Тогда
			Элементы.КачествоОгранки.Видимость = Истина;
			Элементы.ГруппаДоп.Видимость = Ложь;
			Элементы.ДекорацияВидОгранки.Видимость = Ложь; //+Мельников 20.08.24 Видимость надписи если не заполнен "Вид огранки". Заявка 2736
		ИначеЕсли ЗначениеЗаполнено(ВидВставки) И ВидВставки = Справочники.ЛБ_ДрагоценныеКамни.Бриллиант И 
			ЗначениеЗаполнено(ФормаОгранки) И ЗначениеЗаполнено(ВидОгранки) И
			Элементы.КачествоОгранки.СписокВыбора.Количество() = 0 Тогда
			
			Элементы.КачествоОгранки.Видимость = Ложь;
			Элементы.ГруппаДоп.Видимость = Истина;
			Элементы.ДекорацияВидОгранки.Видимость = Ложь; //+Мельников 20.08.24 Видимость надписи если не заполнен "Вид огранки". Заявка 2736
		Иначе			
			Элементы.КачествоОгранки.Видимость = Ложь;
			Элементы.ГруппаДоп.Видимость = Ложь;
			Элементы.ДекорацияВидОгранки.Видимость = Истина; //+Мельников 20.08.24 Видимость надписи если не заполнен "Вид огранки". Заявка 2736
		КонецЕсли;
		
		Если Элементы.КачествоОгранки.Видимость = Истина И ЗначениеЗаполнено(КачествоОгранки) Тогда
			Элементы.ГруппаДоп.Видимость = Истина;
		ИначеЕсли Элементы.КачествоОгранки.Видимость = Истина И НЕ ЗначениеЗаполнено(КачествоОгранки) Тогда
			Элементы.ГруппаДоп.Видимость = Ложь;
		КонецЕсли;
		
		Элементы.Вес.Видимость = Истина;
		Элементы.ВесШт.Видимость = Истина;
		
	ИначеЕсли ЗначениеЗаполнено(ВидВставки) И ВидВставки <> Справочники.ЛБ_ДрагоценныеКамни.Бриллиант Тогда
		//+Мельников 07.08.24 Заявка 2736
		Если ЗначениеЗаполнено(ВидВставки) И ЗначениеЗаполнено(ФормаОгранки)
			И (Элементы.ВидОгранки.СписокВыбора.Количество() > 0 И ЗначениеЗаполнено(ВидОгранки)) Тогда
			Элементы.ГруппаДоп.Видимость = Истина;
		ИначеЕсли ЗначениеЗаполнено(ВидВставки) И ЗначениеЗаполнено(ФормаОгранки)
			И Элементы.ВидОгранки.СписокВыбора.Количество() = 0 Тогда
			Элементы.ГруппаДоп.Видимость = Истина;
		Иначе
			Элементы.ГруппаДоп.Видимость = Ложь;
			Элементы.ДекорацияВидОгранки.Видимость = Истина; //+Мельников 20.08.24 Видимость надписи если не заполнен "Вид огранки". Заявка 2736
		КонецЕсли;
		
		Если ВесВручную Тогда
			Элементы.Группа1.Доступность = Истина;
			Элементы.ГруппаВес1.Доступность = Истина;
			Элементы.ГруппаВес2.Доступность = Истина;
		Иначе
			Элементы.Группа1.Доступность = Ложь;
			Элементы.ГруппаВес1.Доступность = Ложь;
			Элементы.ГруппаВес2.Доступность = Ложь;
		КонецЕсли;

		Элементы.КачествоОгранки.Видимость = Ложь;
		Элементы.Вес.Видимость = Ложь;
		Элементы.ВесШт.Видимость = Ложь;

		//+Мельников 20.08.24 Видимость надписи если не заполнен "Вид огранки". Заявка 2736
		Если Элементы.ВидОгранки.СписокВыбора.Количество() > 0 И ЗначениеЗаполнено(ВидОгранки) Тогда
			Элементы.ДекорацияВидОгранки.Видимость = Ложь;
		ИначеЕсли Элементы.ВидОгранки.СписокВыбора.Количество() > 0 И НЕ ЗначениеЗаполнено(ВидОгранки) Тогда
			Элементы.ДекорацияВидОгранки.Видимость = Истина;
		ИначеЕсли Элементы.ВидОгранки.СписокВыбора.Количество() = 0 Тогда
			Элементы.ДекорацияВидОгранки.Видимость = Ложь;
		КонецЕсли;
		//-Мельников
	КонецЕсли;
	//-Мельников

Конецпроцедуры	

&НаСервере
Процедура ПолучитьСпособРасчетаВеса()  
	Если ВесВручную Тогда
		Формула = "";
		СпособРасчетаВеса = Перечисления.ЛБ_СпособыРасчетаВесаДрагоценныхКамней.Вручную;
	Иначе	
		Если ЗначениеЗаполнено(ВидОгранки) Тогда 
			Запрос = Новый Запрос;  
			Запрос.УстановитьПараметр("ВидКамня", ВидВставки); 
			Запрос.УстановитьПараметр("ФормаОгранки", ФормаОгранки); 
			Запрос.УстановитьПараметр("ВидОгранки", ВидОгранки);
		    Запрос.Текст = "ВЫБРАТЬ
		                   |	ЛБ_НастройкаДопустимыхВидовОгранки.Формула КАК Формула,
		                   |	ЛБ_НастройкаДопустимыхВидовОгранки.СпособРасчетаВеса КАК СпособРасчетаВеса
		                   |ИЗ
		                   |	РегистрСведений.ЛБ_НастройкаДопустимыхВидовОгранки КАК ЛБ_НастройкаДопустимыхВидовОгранки
		                   |ГДЕ
		                   |	ЛБ_НастройкаДопустимыхВидовОгранки.ВидКамня = &ВидКамня
		                   |	И ЛБ_НастройкаДопустимыхВидовОгранки.ФормаОгранки = &ФормаОгранки
		                   |	И ЛБ_НастройкаДопустимыхВидовОгранки.ВидОгранки = &ВидОгранки
		                   |АВТОУПОРЯДОЧИВАНИЕ";
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				Формула = Выборка.Формула;
			    СпособРасчетаВеса = Выборка.СпособРасчетаВеса; 
				Элементы.ДекорацияФормула.Заголовок = "Формула расчета веса: " + Формула;
			Иначе 
				Формула = "";
			    СпособРасчетаВеса = Перечисления.ЛБ_СпособыРасчетаВесаДрагоценныхКамней.Вручную;
			КонецЕсли;	
		Иначе        
			Формула = "";
			СпособРасчетаВеса = Перечисления.ЛБ_СпособыРасчетаВесаДрагоценныхКамней.Вручную;
		КонецЕсли;   
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура РассчитатьВесКамняПоТаблице() 
	//+Мельников 07.10.24 Вставки. Заявка 2736. При изменении значения вначале приводим вес к нулю.
	ВесШт = 0;
	ВесГраммыШт = 0;
	Вес = 0;
	ВесГраммы = 0;
	//-Мельников
	
	Размер1 = 0;
	Если Элементы.ГруппаД0.Видимость Тогда
		Размер1 = Диаметр;
	иначеЕсли Элементы.ГруппаД.Видимость Тогда
		Размер1 = Длина; 
	иначеЕсли Элементы.ГруппаС.Видимость Тогда
		Размер1 = Сторона;   		
	КонецЕсли;	
	Результат = ЛБ_ОбщийМодуль.РассчитатьВесДрагоценногоКамня(ВидВставки, ФормаОгранки, ВидОгранки, КачествоОгранки, Размер1, Ширина1, Высота1); 
	Если НЕ Результат = неопределено Тогда
		Если Результат.ЕдиницаИзмерения.Код = "162" тогда
			ВесШт = Результат.Вес;
			ВесГраммыШт = ЛБ_ОбщегоНазначения.ПересчетИзКаратовВГраммы(ВесШт);
		ИначеЕсли Результат.ЕдиницаИзмерения.Код = "163" тогда  
			ВесГраммыШт = Результат.Вес;
			ВесШт = ЛБ_ОбщегоНазначения.ПересчетИзГраммовВКараты(ВесГраммыШт);
		КонецЕсли;
		РассчитатьОбщийВес();
	КонецЕсли;	
КонецПроцедуры


&НаСервере
Процедура РассчитатьВесКамняПоФормуле()    
	//+Мельников 07.10.24 Вставки. Заявка 2736. При изменении значения вначале приводим вес к нулю.
	ВесШт = 0;
	ВесГраммыШт = 0;
	Вес = 0;
	ВесГраммы = 0;
	//-Мельников

	Если НЕ ПустаяСтрока(Формула) Тогда  
		ФормулаРасчета = Формула;
		ЗначениеВеса = ЛБ_УправлениеЛомбардом.РассчитатьПоФормуле(ФормулаРасчета, Диаметр, Диаметр1, Диаметр2, Длина, Ширина1, Высота1, Сторона);  
	Иначе  
		ЗначениеВеса = 0;
	КонецЕсли;	
	Если ЕдиницаИзмерения.Код = "162" тогда  
		ВесШт = ЗначениеВеса;   
		ВесГраммыШт = ЛБ_ОбщегоНазначения.ПересчетИзКаратовВГраммы(ВесШт);
	ИначеЕсли ЕдиницаИзмерения.Код = "163" тогда 
		ВесГраммыШт = ЗначениеВеса;
		ВесШт = ЛБ_ОбщегоНазначения.ПересчетИзГраммовВКараты(ВесГраммыШт);
	КонецЕсли;    
	РассчитатьОбщийВес();
КонецПроцедуры

&НаСервере
Процедура РассчитатьОбщийВес() 
	Вес = окр(ВесШт*Количество, 3);
	//++ИВВ 04.2026, вычеты для часов ч.2, изменение знаков после запятой
	//было:
	//ВесГраммы = окр(ВесГраммыШт*Количество, 3);
	ВесГраммы = окр(ВесГраммыШт*Количество, 2, РежимОкругления.Окр15как10);
	//--ИВВ
КонецПроцедуры

&НаСервере
Процедура РасчетВеса()
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьСписокВыбораВидовОгранки()

	//+Мельников 12.08.24 Проверяем на булево ограничения списка видов огранки. Заявка 2740.
	Если ОграниченныйСписокВидовОгранки(ФормаОгранки, КатегорияОбъектаЗалога) Тогда
		СписокВ = ЛБ_УправлениеЛомбардом.ПолучитьСписокВыбораВидовОгранки(ВидВставки, ФормаОгранки, Истина, Истина); //+Мельников 08.08.24 Добавлен параметр. Заявка 2736
																											//+Мельников 12.08.24 Добавлен четвертый параметр. Заявка 2740.
	Иначе
		СписокВ = ЛБ_УправлениеЛомбардом.ПолучитьСписокВыбораВидовОгранки(ВидВставки, ФормаОгранки, Истина); //+Мельников 08.08.24 Добавлен параметр. Заявка 2736
	КонецЕсли;
	//-Мельников

	Элементы.ВидОгранки.СписокВыбора.Очистить();
	Для каждого Эл из СписокВ Цикл  
		Элементы.ВидОгранки.СписокВыбора.Добавить(Эл.Значение);
	Конеццикла;	
	//+Мельников 18.06.24 При редактировании не верно отображаются данные редактируемой позиции
	Если Параметры.Свойство("ВидОгранки") И ЗначениеЗаполнено(Параметры.ВидОгранки) Тогда
		ВидОгранки = Параметры.ВидОгранки;
	КонецЕсли;
	//+Мельников 20.08.24 отказались от автоматического заполнения. Заявка 2736
	//+Мельников 08.08.24 Заявка 2736
	//Если Элементы.ВидОгранки.СписокВыбора.Количество() = 1 Тогда
	//	ВидОгранки = Элементы.ВидОгранки.СписокВыбора[0].Значение;
	//КонецЕсли;
	//-Мельников
КонецПроцедуры

&НаСервере
Процедура ПроверитьФормуОгранки() 
	Элементы.ФормаОгранки.СписокВыбора.Очистить();
		
	Запрос = Новый Запрос;  
	Запрос.УстановитьПараметр("ВидКамня", ВидВставки);     
	Элементы.ФормаОгранки.СписокВыбора.Очистить();
	Запрос.УстановитьПараметр("КатегорияОбъектаЗалога", КатегорияОбъектаЗалога);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛБ_НастройкаДопустимыхФормОгранки.ФормаОгранки КАК ФормаОгранки
	               |ИЗ
	               |	РегистрСведений.ЛБ_НастройкаДопустимыхФормОгранки КАК ЛБ_НастройкаДопустимыхФормОгранки
	               |ГДЕ
	               |	ЛБ_НастройкаДопустимыхФормОгранки.ВидКамня = &ВидКамня
	               |	И ЛБ_НастройкаДопустимыхФормОгранки.КатегорияОбъектаЗалога = &КатегорияОбъектаЗалога";
	Выборка = Запрос.Выполнить().Выбрать();
	Если НЕ Выборка.Количество() = 0 Тогда
		Пока Выборка.Следующий() Цикл    
			Элементы.ФормаОгранки.СписокВыбора.Добавить(Выборка.ФормаОгранки);
		КонецЦикла;	
	Иначе
		ВыборкаФО = Справочники.ЛБ_ФормыОгранки.Выбрать(,ВидВставки);   
		Пока ВыборкаФО.Следующий() Цикл
			Элементы.ФормаОгранки.СписокВыбора.Добавить(ВыборкаФО.Ссылка);
		КонеЦцикла;
	КонецЕсли;   
	Если НЕ Элементы.ФормаОгранки.СписокВыбора.Количество() = 0 Тогда 
		//+Мельников 18.06.24 При редактировании не верно отображаются данные редактируемой позиции
		//Было: ФормаОгранки = Элементы.ФормаОгранки.СписокВыбора.Получить(0).Значение;
		Если Параметры.Свойство("ФормаОгранки") И ЗначениеЗаполнено(Параметры.ФормаОгранки) Тогда
			ФормаОгранки = Параметры.ФормаОгранки;
		Иначе
			ФормаОгранки = Элементы.ФормаОгранки.СписокВыбора.Получить(0).Значение;
		КонецЕсли;
		//-Мельников
	КонецЕсли;	
КонецПроцедуры    

&НаСервере
Процедура ЗаполнитьСписокВыбораКачестваОгранки() 
	Элементы.КачествоОгранки.СписокВыбора.Очистить();

	Если ВидВставки = Справочники.ЛБ_ДрагоценныеКамни.Бриллиант Тогда 
		Запрос = Новый Запрос;  
		Запрос.УстановитьПараметр("ВидКамня", ВидВставки); 
		Запрос.УстановитьПараметр("КатегорияОбъектаЗалога", КатегорияОбъектаЗалога);
		Запрос.УстановитьПараметр("Именник", Именник); 
		СписокФО = Новый СписокЗначений;
		СписокФО.Добавить(Справочники.ЛБ_ФормыОгранки.ПустаяСсылка());
		Если ЗначениеЗаполнено(ФормаОгранки) Тогда
			СписокФО.Добавить(ФормаОгранки);
		КонецЕсли;	
		Запрос.УстановитьПараметр("ФормыОгранки", СписокФО); 
		СписокВО = Новый СписокЗначений;
		СписокВО.Добавить(Справочники.ЛБ_ВидыОгранки.ПустаяСсылка());
		Если ЗначениеЗаполнено(ВидОгранки) Тогда
			СписокВО.Добавить(ВидОгранки);
		КонецЕсли;	
        Запрос.УстановитьПараметр("ВидыОгранки", СписокВО);
	    Запрос.Текст = "ВЫБРАТЬ
	                   |	ЛБ_НастройкаДопустимыхКачествОгранки.КачествоОгранки КАК КачествоОгранки
	                   |ИЗ
	                   |	РегистрСведений.ЛБ_НастройкаДопустимыхКачествОгранки КАК ЛБ_НастройкаДопустимыхКачествОгранки
	                   |ГДЕ
	                   |	ЛБ_НастройкаДопустимыхКачествОгранки.ВидКамня = &ВидКамня
	                   |	И ЛБ_НастройкаДопустимыхКачествОгранки.КатегорияОбъектаЗалога = &КатегорияОбъектаЗалога
	                   |	И ЛБ_НастройкаДопустимыхКачествОгранки.ФормаОгранки В(&ФормыОгранки)
	                   |	И ЛБ_НастройкаДопустимыхКачествОгранки.ВидОгранки В(&ВидыОгранки)";
	                  // |	И ЛБ_НастройкаДопустимыхКачествОгранки.Именник = &Именник"; 
		 Выборка = Запрос.Выполнить().Выбрать();
		 Пока Выборка.Следующий() Цикл 
			 Элементы.КачествоОгранки.СписокВыбора.Добавить(Выборка.КачествоОгранки);
		 Конеццикла;
		 //+Мельников 18.06.24 При редактировании не верно отображаются данные редактируемой позиции
		 Если Параметры.Свойство("КачествоОгранки") И ЗначениеЗаполнено(Параметры.КачествоОгранки) Тогда
			 КачествоОгранки = Параметры.КачествоОгранки;
		 КонецЕсли;
		 //-Мельников
	 Иначе    
		 Запрос = Новый Запрос;
		 Запрос.УстановитьПараметр("Владелец", ВидВставки);
		 Запрос.Текст = "ВЫБРАТЬ
		                |	ЛБ_КачествоОгранки.Ссылка КАК КачествоОгранки
						|ИЗ
		                |	Справочник.ЛБ_КачествоОгранки КАК ЛБ_КачествоОгранки
		                |ГДЕ
		                |	ЛБ_КачествоОгранки.Владелец = &Владелец
		                |	И ЛБ_КачествоОгранки.ПометкаУдаления = ЛОЖЬ";
		 Выборка = Запрос.Выполнить().Выбрать();
		 Пока Выборка.Следующий() Цикл 
			 Элементы.КачествоОгранки.СписокВыбора.Добавить(Выборка.КачествоОгранки);
		 Конеццикла;
	 КонецЕсли;	 
КонецПроцедуры	                                                          

&НаСервере
Функция УдалитьНули(Текст)
	Текст = СокрЛП(Текст);
	Пока Прав(Текст, 1) = "0" цикл
		Текст = Лев(Текст, стрДлина(Текст) - 1);
	Конеццикла;	
	Возврат Текст;
КонецФункции	

&НаКлиенте
Функция СформироватьСтрокуРазмер() 
	ОписаниеРазмера = "";  
	ОписаниеРазмера = ОписаниеРазмера + ?(Диаметр = 0, "", ?(ПустаяСтрока(ОписаниеРазмера), "", "х") + УдалитьНули(Строка(Диаметр))); 
	ОписаниеРазмера = ОписаниеРазмера + ?(Диаметр1 = 0, "", ?(ПустаяСтрока(ОписаниеРазмера), "", "х") + УдалитьНули(Строка(Диаметр1)));
	ОписаниеРазмера = ОписаниеРазмера + ?(Диаметр2 = 0, "", ?(ПустаяСтрока(ОписаниеРазмера), "", "х") + УдалитьНули(Строка(Диаметр2)));
	ОписаниеРазмера = ОписаниеРазмера + ?(Длина = 0, "", ?(ПустаяСтрока(ОписаниеРазмера), "", "х") + УдалитьНули(Строка(Длина)));
	ОписаниеРазмера = ОписаниеРазмера + ?(Ширина1 = 0, "", ?(ПустаяСтрока(ОписаниеРазмера), "", "х") + УдалитьНули(Строка(Ширина1)));
	ОписаниеРазмера = ОписаниеРазмера + ?(Высота1 = 0, "", ?(ПустаяСтрока(ОписаниеРазмера), "", "хh") + УдалитьНули(Строка(Высота1))); 
	ОписаниеРазмера = ОписаниеРазмера + ?(Сторона = 0, "", ?(ПустаяСтрока(ОписаниеРазмера), "", "х") + УдалитьНули(Строка(Сторона)));
	Возврат ОписаниеРазмера; 
КонецФункции

Функция Проверить()
	ВсеОК = Истина;   
	Если НЕ ЗначениеЗаполнено(ВидВставки) тогда   
		Сообщить("Не выбран вид вставки");
		ВсеОК = ложь;
	КонецЕсли; 
	Если Количество = 0 тогда   
		Сообщить("Не задано количество");
		ВсеОК = ложь;
	КонецЕсли;  
	//+Мельников Отображение сообщения для вида огранки. Добавлена проверка на бриллиант. Заявка 2736
	//Если ВесГраммы = 0 И ВидВставки = ПредопределенноеЗначение("Справочник.ЛБ_ДрагоценныеКамни.Бриллиант") тогда   
	//	Сообщить("Не задан вес в каратах");
	//	ВсеОК = ложь;
	//КонецЕсли; 
	//Если ВесГраммы = 0 И ВидВставки = ПредопределенноеЗначение("Справочник.ЛБ_ДрагоценныеКамни.Бриллиант") тогда   
	//	Сообщить("Не задан вес в граммах");
	//	ВсеОК = ложь;
	//КонецЕсли; 
	
	Если НЕ ЗначениеЗаполнено(ВидОгранки) И ВидВставки <> ПредопределенноеЗначение("Справочник.ЛБ_ДрагоценныеКамни.Бриллиант") Тогда
		Сообщить("Для расчета веса необходимо выбрать ""Вид огранки"".");
		ВсеОК = Ложь;
	КонецЕсли;

	//+Мельников 21.08.24 Изменена проверка заполнения элементов и вывод соответствующего сообщения. Заявка 2736
	//+Мельников 07.10.24 Изменения. Заявка 2736
	Если (ВидВставки = ПредопределенноеЗначение("Справочник.ЛБ_ДрагоценныеКамни.Бриллиант") И ВесШт = 0)
		ИЛИ ВидВставки <> ПредопределенноеЗначение("Справочник.ЛБ_ДрагоценныеКамни.Бриллиант") И ВесГраммыШт = 0 Тогда
		//Было: (НЕ ВесВручную И ((Элементы.ГруппаД0.Видимость И Диаметр = 0) ИЛИ (Элементы.ГруппаД1.Видимость И Диаметр1 = 0)
		//ИЛИ (Элементы.ГруппаД2.Видимость И Диаметр2 = 0) ИЛИ (Элементы.ГруппаД.Видимость И Длина = 0)
		//ИЛИ (Элементы.ГруппаШ.Видимость И Ширина1 = 0) ИЛИ (Элементы.ГруппаВ.Видимость И Высота1 = 0)
		//ИЛИ (Элементы.ГруппаС.Видимость И Сторона = 0))) 
		//ИЛИ (ВесВручную И ВидВставки = ПредопределенноеЗначение("Справочник.ЛБ_ДрагоценныеКамни.Бриллиант") И ВесШт = 0)
		//ИЛИ (ВесВручную И ВидВставки <> ПредопределенноеЗначение("Справочник.ЛБ_ДрагоценныеКамни.Бриллиант") И ВесГраммыШт = 0) Тогда
		
		Сообщить("Необходимо внести размеры вставки или указать вес вручную.");
		ВсеОК = Ложь;
	КонецЕсли;
	//-Мельников
	Возврат ВсеОК;
КонецФункции

&НаКлиенте
Процедура СохранитьИЗакрыть(Команда)
	Если НЕ Проверить() Тогда
		Возврат;
	КонецЕсли;
	СтруктураВозврата = Новый структура;   
	СтруктураВозврата.Вставить("ВесВручную", ВесВручную);
	СтруктураВозврата.Вставить("Количество", Количество); 
	СтруктураВозврата.Вставить("ВидВставки", ВидВставки);
	СтруктураВозврата.Вставить("ЕдиницаИзмерения", ЕдиницаИзмерения);
	СтруктураВозврата.Вставить("ФормаОгранки", ФормаОгранки);
	СтруктураВозврата.Вставить("ВидОгранки", ВидОгранки);
	СтруктураВозврата.Вставить("КачествоОгранки", КачествоОгранки); 
	СтруктураВозврата.Вставить("Диаметр", Диаметр);
	СтруктураВозврата.Вставить("Диаметр1", Диаметр1);
	СтруктураВозврата.Вставить("Диаметр2", Диаметр2); 
	СтруктураВозврата.Вставить("Длина", Длина);  
	СтруктураВозврата.Вставить("Ширина", Ширина1);
	СтруктураВозврата.Вставить("Высота", Высота1);
	СтруктураВозврата.Вставить("Сторона", Сторона);
	СтруктураВозврата.Вставить("Вес", Вес); 
	СтруктураВозврата.Вставить("ВесГраммы", ВесГраммы);
	СтруктураВозврата.Вставить("ОписаниеРазмера", СформироватьСтрокуРазмер());
	СтруктураВозврата.Вставить("ВесШтКар", ВесШт); //+Мельников 24.07.24 Для расчета суммы если количество больше 1. Заяка 2738
	СтруктураВозврата.Вставить("ВесГраммыШт", ВесГраммыШт); //+Мельников 24.07.24 Для расчета суммы если количество больше 1. Заяка 2738
	Этаформа.Закрыть(СтруктураВозврата);
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Этаформа.Закрыть(?(НоваяСтрока, ложь, неопределено));
КонецПроцедуры

&НаСервере
Функция ПолучитьЕдиницуРасчета()
	Возврат ВидВставки.ЕдиницаИзмерения;
КонецФункции	

&НаКлиенте
Процедура ВидВставкиПриИзменении(Элемент)	
	ЕдиницаИзмерения = ПолучитьЕдиницуРасчета();
	ВидОгранки = ПредопределенноеЗначение("Справочник.ЛБ_ВидыОгранки.ПустаяСсылка"); 
	ФормаОгранки = ПредопределенноеЗначение("Справочник.ЛБ_ФормыОгранки.ПустаяСсылка");
	КачествоОгранки = ПредопределенноеЗначение("Справочник.ЛБ_КачествоОгранки.ПустаяСсылка");
	ЗаполнитьСписокВыбораКачестваОгранки();
	ПроверитьФормуОгранки(); 
	ЗаполнитьСписокВыбораВидовОгранки();
	УстановитьВидимость(); 
	ПолучитьСпособРасчетаВеса();
	УстановитьДоступность(); 
	Если СпособРасчетаВеса = ПредопределенноеЗначение("Перечисление.ЛБ_СпособыРасчетаВесаДрагоценныхКамней.ПоТаблице") Тогда
		РассчитатьВесКамняПоТаблице();  
	ИначеЕсли СпособРасчетаВеса = ПредопределенноеЗначение("Перечисление.ЛБ_СпособыРасчетаВесаДрагоценныхКамней.ПоФормуле") Тогда
		РассчитатьВесКамняПоФормуле();	
	КонецЕсли;	
	ОчиститьДопПараметры(); //+Мельников 30.07.24 Заявка 2736
КонецПроцедуры


&НаКлиенте
Процедура ФормаОгранкиПриИзменении(Элемент)
	//+Мельников 08.08.24
	ВидОгранки = ПредопределенноеЗначение("Справочник.ЛБ_ВидыОгранки.ПустаяСсылка");
	//-Мельников
	УстановитьВидимость(); 
	ЗаполнитьСписокВыбораВидовОгранки(); 
	ЗаполнитьСписокВыбораКачестваОгранки();
	ПолучитьСпособРасчетаВеса();
	УстановитьДоступность();
	Если СпособРасчетаВеса = ПредопределенноеЗначение("Перечисление.ЛБ_СпособыРасчетаВесаДрагоценныхКамней.ПоТаблице") Тогда
		РассчитатьВесКамняПоТаблице(); 
	ИначеЕсли СпособРасчетаВеса = ПредопределенноеЗначение("Перечисление.ЛБ_СпособыРасчетаВесаДрагоценныхКамней.ПоФормуле") Тогда
		РассчитатьВесКамняПоФормуле();	
	КонецЕсли;	
	ОчиститьДопПараметры(); //+Мельников 30.07.24 Заявка 2736
КонецПроцедуры


&НаКлиенте
Процедура ВидОгранкиПриИзменении(Элемент)
	УстановитьВидимость();     
	ЗаполнитьСписокВыбораКачестваОгранки();
	ПолучитьСпособРасчетаВеса();
	УстановитьДоступность();
	Если СпособРасчетаВеса = ПредопределенноеЗначение("Перечисление.ЛБ_СпособыРасчетаВесаДрагоценныхКамней.ПоТаблице") Тогда
		РассчитатьВесКамняПоТаблице(); 
	ИначеЕсли СпособРасчетаВеса = ПредопределенноеЗначение("Перечисление.ЛБ_СпособыРасчетаВесаДрагоценныхКамней.ПоФормуле") Тогда
		РассчитатьВесКамняПоФормуле();	
	КонецЕсли;	
	ОчиститьДопПараметры(); //+Мельников 30.07.24 Заявка 2736
КонецПроцедуры

&НаКлиенте
Процедура КачествоОгранкиПриИзменении(Элемент)
	УстановитьДоступность(); //+Мельников 29.07.24
	Если СпособРасчетаВеса = ПредопределенноеЗначение("Перечисление.ЛБ_СпособыРасчетаВесаДрагоценныхКамней.ПоТаблице") Тогда
		РассчитатьВесКамняПоТаблице();  
	ИначеЕсли СпособРасчетаВеса = ПредопределенноеЗначение("Перечисление.ЛБ_СпособыРасчетаВесаДрагоценныхКамней.ПоФормуле") Тогда
		РассчитатьВесКамняПоФормуле();		
	КонецЕсли;	
	ОчиститьДопПараметры(); //+Мельников 30.07.24 Заявка 2736
КонецПроцедуры

&НаКлиенте
Процедура КоличествоПриИзменении(Элемент) 
	РассчитатьОбщийВес();
КонецПроцедуры

&НаКлиенте
Процедура ВесШтПриИзменении(Элемент)
	ВесГраммыШт = ЛБ_ОбщегоНазначения.ПересчетИзКаратовВГраммы(ВесШт);
	РассчитатьОбщийВес();
КонецПроцедуры


&НаКлиенте
Процедура ВесГраммыШтПриИзменении(Элемент)
	ВесШт = ЛБ_ОбщегоНазначения.ПересчетИзГраммовВКараты(ВесГраммыШт);
	РассчитатьОбщийВес();
КонецПроцедуры

&НаКлиенте
Процедура ДиаметрПриИзменении(Элемент)
	//+МАН 22.04.25 Добавлена проверка диаметра. Заявка 2956
	Если Диаметр >= 1 Тогда
		Если СпособРасчетаВеса = ПредопределенноеЗначение("Перечисление.ЛБ_СпособыРасчетаВесаДрагоценныхКамней.ПоТаблице") Тогда
			РассчитатьВесКамняПоТаблице();
		ИначеЕсли СпособРасчетаВеса = ПредопределенноеЗначение("Перечисление.ЛБ_СпособыРасчетаВесаДрагоценныхКамней.ПоФормуле") Тогда
			РассчитатьВесКамняПоФормуле();	
		КонецЕсли;	
	Иначе
		//lion 12.08.2025
		//Сообщить("Диаметр бриллианта не может быть меньше 1,00 мм");
		Сообщить("Диаметр вставки не может быть меньше 1,00 мм");
		Диаметр = 0;
		ВесШт = 0;
		Вес = 0;
		ВесГраммыШт = 0;
		ВесГраммы = 0;
	КонецЕсли;
	//-МАН
КонецПроцедуры

&НаКлиенте
Процедура Диаметр1ПриИзменении(Элемент)
	//+МАН 22.04.25 Добавлена проверка диаметра. Заявка 2956
	Если Диаметр1 >= 1 Тогда
		Если СпособРасчетаВеса = ПредопределенноеЗначение("Перечисление.ЛБ_СпособыРасчетаВесаДрагоценныхКамней.ПоТаблице") Тогда
			РассчитатьВесКамняПоТаблице();
		ИначеЕсли СпособРасчетаВеса = ПредопределенноеЗначение("Перечисление.ЛБ_СпособыРасчетаВесаДрагоценныхКамней.ПоФормуле") Тогда
			РассчитатьВесКамняПоФормуле();	
		КонецЕсли;	
	Иначе
		Сообщить("Диаметр бриллианта не может быть меньше 1,00 мм");
		Диаметр1 = 0;
		ВесШт = 0;
		Вес = 0;
		ВесГраммыШт = 0;
		ВесГраммы = 0;
	КонецЕсли;
	//-МАН
КонецПроцедуры

&НаКлиенте
Процедура Диаметр2ПриИзменении(Элемент)
	//+МАН 22.04.25 Добавлена проверка диаметра. Заявка 2956
	Если Диаметр2 >= 1 Тогда
		Если СпособРасчетаВеса = ПредопределенноеЗначение("Перечисление.ЛБ_СпособыРасчетаВесаДрагоценныхКамней.ПоТаблице") Тогда
			РассчитатьВесКамняПоТаблице();
		ИначеЕсли СпособРасчетаВеса = ПредопределенноеЗначение("Перечисление.ЛБ_СпособыРасчетаВесаДрагоценныхКамней.ПоФормуле") Тогда
			РассчитатьВесКамняПоФормуле();	
		КонецЕсли;	
	Иначе
		Сообщить("Диаметр бриллианта не может быть меньше 1,00 мм");
		Диаметр2 = 0;
		ВесШт = 0;
		Вес = 0;
		ВесГраммыШт = 0;
		ВесГраммы = 0;
	КонецЕсли;
	//-МАН
КонецПроцедуры

&НаКлиенте
Процедура ДлинаПриИзменении(Элемент)
	Если СпособРасчетаВеса = ПредопределенноеЗначение("Перечисление.ЛБ_СпособыРасчетаВесаДрагоценныхКамней.ПоТаблице") Тогда
		РассчитатьВесКамняПоТаблице();
	ИначеЕсли СпособРасчетаВеса = ПредопределенноеЗначение("Перечисление.ЛБ_СпособыРасчетаВесаДрагоценныхКамней.ПоФормуле") Тогда
		РассчитатьВесКамняПоФормуле();	
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура Ширина1ПриИзменении(Элемент)
	Если СпособРасчетаВеса = ПредопределенноеЗначение("Перечисление.ЛБ_СпособыРасчетаВесаДрагоценныхКамней.ПоТаблице") Тогда
		РассчитатьВесКамняПоТаблице();
	ИначеЕсли СпособРасчетаВеса = ПредопределенноеЗначение("Перечисление.ЛБ_СпособыРасчетаВесаДрагоценныхКамней.ПоФормуле") Тогда
		РассчитатьВесКамняПоФормуле();	
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура Высота1ПриИзменении(Элемент)
	Если СпособРасчетаВеса = ПредопределенноеЗначение("Перечисление.ЛБ_СпособыРасчетаВесаДрагоценныхКамней.ПоТаблице") Тогда
		РассчитатьВесКамняПоТаблице();
	ИначеЕсли СпособРасчетаВеса = ПредопределенноеЗначение("Перечисление.ЛБ_СпособыРасчетаВесаДрагоценныхКамней.ПоФормуле") Тогда
		РассчитатьВесКамняПоФормуле();	
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Этаформа.Закрыть(?(НоваяСтрока, ложь, неопределено));
КонецПроцедуры

&НаКлиенте
Процедура СторонаПриИзменении(Элемент)

	Если СпособРасчетаВеса = ПредопределенноеЗначение("Перечисление.ЛБ_СпособыРасчетаВесаДрагоценныхКамней.ПоТаблице") Тогда
		РассчитатьВесКамняПоТаблице();
	ИначеЕсли СпособРасчетаВеса = ПредопределенноеЗначение("Перечисление.ЛБ_СпособыРасчетаВесаДрагоценныхКамней.ПоФормуле") Тогда
		РассчитатьВесКамняПоФормуле();	
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ВесВручнуюПриИзменении(Элемент)
	ПолучитьСпособРасчетаВеса();
	УстановитьДоступность();
	Если НЕ ВесВручную Тогда  
		Если СпособРасчетаВеса = ПредопределенноеЗначение("Перечисление.ЛБ_СпособыРасчетаВесаДрагоценныхКамней.ПоТаблице") Тогда
			РассчитатьВесКамняПоТаблице();
		ИначеЕсли СпособРасчетаВеса = ПредопределенноеЗначение("Перечисление.ЛБ_СпособыРасчетаВесаДрагоценныхКамней.ПоФормуле") Тогда
			РассчитатьВесКамняПоФормуле();	
		КонецЕсли;	
	//+Мельников 25.07.24 Если вес вручную то размеры не видно. Заявка 2737
		Элементы.ГруппаРазмеры.Доступность = Истина;
	Иначе
		Элементы.ГруппаРазмеры.Доступность = Ложь;
	//-Мельников
	КонецЕсли;    	   

	//+Мельников 25.07.24 Если вес вручную и категория 3 или 4 то доступен ввод общего веса в каратах. Заявка 2737
	Если ВесВручную И ПолучитьКачество(КатегорияОбъектаЗалога) Тогда
		Элементы.Вес.ТолькоПросмотр = Ложь;
	Иначе
		Элементы.Вес.ТолькоПросмотр = Истина;
	КонецЕсли;
	//-Мельников
КонецПроцедуры

&НаКлиенте
Процедура ВидОгранкиНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	Если (ЭтаФорма.ВидВставки = ПредопределенноеЗначение("Справочник.ЛБ_ДрагоценныеКамни.Бриллиант")) И НЕ ЗначениеЗаполнено(ФормаОгранки) Тогда
		СтандартнаяОбработка = Ложь; 
		Возврат;
	КонецЕсли;	
КонецПроцедуры

//+Мельников 25.07.24 Если вес вручную и категория 3 или 4 то доступен ввод общего веса в каратах. Заявка 2737
&НаКлиенте
Процедура ВесПриИзменении(Элемент)
	ВесГраммы = ЛБ_ОбщегоНазначения.ПересчетИзКаратовВГраммы(Вес);
	ВесШт = Окр(Вес/Количество, 3);
	ВесГраммыШт = Окр(ВесГраммы/Количество, 3);
КонецПроцедуры

&НаСервере
Функция ПолучитьКачество(КатегорияОбъектаЗалога)
	Возврат КатегорияОбъектаЗалога.ПониженноеКачество;
КонецФункции

//+Мельников 30.07.24 Заявка 2736
&НаКлиенте
Процедура ОчиститьДопПараметры()
	Диаметр = 0;
	Диаметр1 = 0;
	Диаметр2 = 0;
	Длина = 0;
	Ширина1 = 0;
	Высота1 = 0;
	Сторона = 0;
	ВесШт = 0;
	Вес = 0;
	ВесГраммыШт = 0;
	ВесГраммы = 0;
КонецПроцедуры

//+Мельников 12.08.24 Проверяем на булево ограничения списка видов огранки. Заявка 2740.
&НаСервереБезКонтекста
Функция ОграниченныйСписокВидовОгранки(ФормаОгранки, КатегорияОбъектаЗалога)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_НастройкаДопустимыхФормОгранки.ОграниченныйСписокВидовОгранки КАК ОграниченныйСписокВидовОгранки
		|ИЗ
		|	РегистрСведений.ЛБ_НастройкаДопустимыхФормОгранки КАК ЛБ_НастройкаДопустимыхФормОгранки
		|ГДЕ
		|	ЛБ_НастройкаДопустимыхФормОгранки.ФормаОгранки = &ФормаОгранки
		|	И ЛБ_НастройкаДопустимыхФормОгранки.КатегорияОбъектаЗалога = &КатегорияОбъектаЗалога";
	
	Запрос.УстановитьПараметр("КатегорияОбъектаЗалога", КатегорияОбъектаЗалога);
	Запрос.УстановитьПараметр("ФормаОгранки", ФормаОгранки);
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		Возврат Результат.ОграниченныйСписокВидовОгранки;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции
//-Мельников
